ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx5112mtsh100_1.h
#if (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#define FLEXCOM0     (0x40000000U) /**< \brief (FLEXCOM0    ) Base Address */
#define PDC_FLEXCOM0 (0x40000100U) /**< \brief (PDC_FLEXCOM0) Base Address */
#define USART0       (0x40000200U) /**< \brief (USART0      ) Base Address */
#define PDC_USART0   (0x40000300U) /**< \brief (PDC_USART0  ) Base Address */
#define SPI0         (0x40000400U) /**< \brief (SPI0        ) Base Address */
#define PDC_SPI0     (0x40000500U) /**< \brief (PDC_SPI0    ) Base Address */
#define TWI0         (0x40000600U) /**< \brief (TWI0        ) Base Address */
#define PDC_TWI0     (0x40000700U) /**< \brief (PDC_TWI0    ) Base Address */
#define FLEXCOM1     (0x40004000U) /**< \brief (FLEXCOM1    ) Base Address */
#define PDC_FLEXCOM1 (0x40004100U) /**< \brief (PDC_FLEXCOM1) Base Address */
#define USART1       (0x40004200U) /**< \brief (USART1      ) Base Address */
#define PDC_USART1   (0x40004300U) /**< \brief (PDC_USART1  ) Base Address */
#define SPI1         (0x40004400U) /**< \brief (SPI1        ) Base Address */
#define PDC_SPI1     (0x40004500U) /**< \brief (PDC_SPI1    ) Base Address */
#define TWI1         (0x40004600U) /**< \brief (TWI1        ) Base Address */
#define PDC_TWI1     (0x40004700U) /**< \brief (PDC_TWI1    ) Base Address */
#define FLEXCOM2     (0x40008000U) /**< \brief (FLEXCOM2    ) Base Address */
#define PDC_FLEXCOM2 (0x40008100U) /**< \brief (PDC_FLEXCOM2) Base Address */
#define USART2       (0x40008200U) /**< \brief (USART2      ) Base Address */
#define PDC_USART2   (0x40008300U) /**< \brief (PDC_USART2  ) Base Address */
#define SPI2         (0x40008400U) /**< \brief (SPI2        ) Base Address */
#define PDC_SPI2     (0x40008500U) /**< \brief (PDC_SPI2    ) Base Address */
#define TWI2         (0x40008600U) /**< \brief (TWI2        ) Base Address */
#define PDC_TWI2     (0x40008700U) /**< \brief (PDC_TWI2    ) Base Address */
#define FLEXCOM3     (0x4000C000U) /**< \brief (FLEXCOM3    ) Base Address */
#define PDC_FLEXCOM3 (0x4000C100U) /**< \brief (PDC_FLEXCOM3) Base Address */
#define USART3       (0x4000C200U) /**< \brief (USART3      ) Base Address */
#define PDC_USART3   (0x4000C300U) /**< \brief (PDC_USART3  ) Base Address */
#define SPI3         (0x4000C400U) /**< \brief (SPI3        ) Base Address */
#define PDC_SPI3     (0x4000C500U) /**< \brief (PDC_SPI3    ) Base Address */
#define TWI3         (0x4000C600U) /**< \brief (TWI3        ) Base Address */
#define PDC_TWI3     (0x4000C700U) /**< \brief (PDC_TWI3    ) Base Address */
#define FLEXCOM4     (0x40010000U) /**< \brief (FLEXCOM4    ) Base Address */
#define PDC_FLEXCOM4 (0x40010100U) /**< \brief (PDC_FLEXCOM4) Base Address */
#define USART4       (0x40010200U) /**< \brief (USART4      ) Base Address */
#define PDC_USART4   (0x40010300U) /**< \brief (PDC_USART4  ) Base Address */
#define SPI4         (0x40010400U) /**< \brief (SPI4        ) Base Address */
#define PDC_SPI4     (0x40010500U) /**< \brief (PDC_SPI4    ) Base Address */
#define TWI4         (0x40010600U) /**< \brief (TWI4        ) Base Address */
#define PDC_TWI4     (0x40010700U) /**< \brief (PDC_TWI4    ) Base Address */
#define FLEXCOM5     (0x40014000U) /**< \brief (FLEXCOM5    ) Base Address */
#define PDC_FLEXCOM5 (0x40014100U) /**< \brief (PDC_FLEXCOM5) Base Address */
#define USART5       (0x40014200U) /**< \brief (USART5      ) Base Address */
#define PDC_USART5   (0x40014300U) /**< \brief (PDC_USART5  ) Base Address */
#define SPI5         (0x40014400U) /**< \brief (SPI5        ) Base Address */
#define PDC_SPI5     (0x40014500U) /**< \brief (PDC_SPI5    ) Base Address */
#define TWI5         (0x40014600U) /**< \brief (TWI5        ) Base Address */
#define PDC_TWI5     (0x40014700U) /**< \brief (PDC_TWI5    ) Base Address */
#define FLEXCOM6     (0x40018000U) /**< \brief (FLEXCOM6    ) Base Address */
#define PDC_FLEXCOM6 (0x40018100U) /**< \brief (PDC_FLEXCOM6) Base Address */
#define USART6       (0x40018200U) /**< \brief (USART6      ) Base Address */
#define PDC_USART6   (0x40018300U) /**< \brief (PDC_USART6  ) Base Address */
#define SPI6         (0x40018400U) /**< \brief (SPI6        ) Base Address */
#define PDC_SPI6     (0x40018500U) /**< \brief (PDC_SPI6    ) Base Address */
#define TWI6         (0x40018600U) /**< \brief (TWI6        ) Base Address */
#define PDC_TWI6     (0x40018700U) /**< \brief (PDC_TWI6    ) Base Address */
#define FLEXCOM7     (0x4001C000U) /**< \brief (FLEXCOM7    ) Base Address */
#define PDC_FLEXCOM7 (0x4001C100U) /**< \brief (PDC_FLEXCOM7) Base Address */
#define USART7       (0x4001C200U) /**< \brief (USART7      ) Base Address */
#define PDC_USART7   (0x4001C300U) /**< \brief (PDC_USART7  ) Base Address */
#define SPI7         (0x4001C400U) /**< \brief (SPI7        ) Base Address */
#define PDC_SPI7     (0x4001C500U) /**< \brief (PDC_SPI7    ) Base Address */
#define TWI7         (0x4001C600U) /**< \brief (TWI7        ) Base Address */
#define PDC_TWI7     (0x4001C700U) /**< \brief (PDC_TWI7    ) Base Address */
#define QSPI         (0x40020000U) /**< \brief (QSPI        ) Base Address */
#define PDC_QSPI     (0x40020100U) /**< \brief (PDC_QSPI    ) Base Address */
#define ADC          (0x40024000U) /**< \brief (ADC         ) Base Address */
#define PDC_ADC      (0x40024100U) /**< \brief (PDC_ADC     ) Base Address */
#define ACC          (0x40028000U) /**< \brief (ACC         ) Base Address */
#define IPC0         (0x4002C000U) /**< \brief (IPC0        ) Base Address */
#define SLCDC        (0x40030000U) /**< \brief (SLCDC       ) Base Address */
#define MEM2MEM0     (0x40034000U) /**< \brief (MEM2MEM0    ) Base Address */
#define PDC_MEM2MEM0 (0x40034100U) /**< \brief (PDC_MEM2MEM0) Base Address */
#define TC0          (0x40038000U) /**< \brief (TC0         ) Base Address */
#define PDC_TC0      (0x40038100U) /**< \brief (PDC_TC0     ) Base Address */
#define TC1          (0x4003C000U) /**< \brief (TC1         ) Base Address */
#define PDC_TC1      (0x4003C100U) /**< \brief (PDC_TC1     ) Base Address */
#define TC2          (0x40040000U) /**< \brief (TC2         ) Base Address */
#define PDC_TC2      (0x40040100U) /**< \brief (PDC_TC2     ) Base Address */
#define MATRIX1      (0x40044000U) /**< \brief (MATRIX1     ) Base Address */
#define PIOA         (0x40048000U) /**< \brief (PIOA        ) Base Address */
#define PIOB         (0x40048040U) /**< \brief (PIOB        ) Base Address */
#define PIOC         (0x40048080U) /**< \brief (PIOC        ) Base Address */
#define CHIPID       (0x40050200U) /**< \brief (CHIPID      ) Base Address */
#define SFR          (0x40050400U) /**< \brief (SFR         ) Base Address */
#define SFRBU        (0x40050600U) /**< \brief (SFRBU       ) Base Address */
#define DWDT         (0x40052000U) /**< \brief (DWDT        ) Base Address */
#define RSTC         (0x40053000U) /**< \brief (RSTC        ) Base Address */
#define RTT          (0x40053020U) /**< \brief (RTT         ) Base Address */
#define GPBR         (0x40053060U) /**< \brief (GPBR        ) Base Address */
#define RTC          (0x40053100U) /**< \brief (RTC         ) Base Address */
#define SYSCWP       (0x400531A0U) /**< \brief (SYSCWP      ) Base Address */
#define SUPC         (0x400531D0U) /**< \brief (SUPC        ) Base Address */
#define AES          (0x44000000U) /**< \brief (AES         ) Base Address */
#define PDC_AES      (0x44000100U) /**< \brief (PDC_AES     ) Base Address */
#define AESB         (0x44004000U) /**< \brief (AESB        ) Base Address */
#define SHA          (0x44008000U) /**< \brief (SHA         ) Base Address */
#define PDC_SHA      (0x44008100U) /**< \brief (PDC_SHA     ) Base Address */
#define TRNG         (0x4400C000U) /**< \brief (TRNG        ) Base Address */
#define ICM          (0x44010000U) /**< \brief (ICM         ) Base Address */
#define CPKCC        (0x46000000U) /**< \brief (CPKCC       ) Base Address */
#define MATRIX0      (0x46004000U) /**< \brief (MATRIX0     ) Base Address */
#define CMCC0        (0x46008000U) /**< \brief (CMCC0       ) Base Address */
#define CMCC1        (0x4600C000U) /**< \brief (CMCC1       ) Base Address */
#define SEFC0        (0x460E0000U) /**< \brief (SEFC0       ) Base Address */
#define SEFC1        (0x460E0200U) /**< \brief (SEFC1       ) Base Address */
#define PMC          (0x46800000U) /**< \brief (PMC         ) Base Address */
#define EMAFE        (0x48000000U) /**< \brief (EMAFE       ) Base Address */
#define MEM2MEM1     (0x48004000U) /**< \brief (MEM2MEM1    ) Base Address */
#define PDC_MEM2MEM1 (0x48004100U) /**< \brief (PDC_MEM2MEM1) Base Address */
#define TC3          (0x48008000U) /**< \brief (TC3         ) Base Address */
#define PDC_TC3      (0x48008100U) /**< \brief (PDC_TC3     ) Base Address */
#define PIOD         (0x4800C000U) /**< \brief (PIOD        ) Base Address */
#define UART         (0x48010000U) /**< \brief (UART        ) Base Address */
#define PDC_UART     (0x48010100U) /**< \brief (PDC_UART    ) Base Address */
#define IPC1         (0x48014000U) /**< \brief (IPC1        ) Base Address */
#define MCSPI        (0x48018000U) /**< \brief (MCSPI       ) Base Address */
#define PDC_MCSPI    (0x48018100U) /**< \brief (PDC_MCSPI   ) Base Address */
#define PWM          (0x4801C000U) /**< \brief (PWM         ) Base Address */
#define PDC_PWM      (0x4801C100U) /**< \brief (PDC_PWM     ) Base Address */
#define MATRIX3      (0x48020000U) /**< \brief (MATRIX3     ) Base Address */
#define MATRIX2      (0x4A000000U) /**< \brief (MATRIX2     ) Base Address */
#else
#define FLEXCOM0     ((Flexcom    *)0x40000000U) /**< \brief (FLEXCOM0    ) Base Address */
#define PDC_FLEXCOM0 ((Pdc        *)0x40000100U) /**< \brief (PDC_FLEXCOM0) Base Address */
#define USART0       ((Usart      *)0x40000200U) /**< \brief (USART0      ) Base Address */
#define PDC_USART0   ((Pdc        *)0x40000300U) /**< \brief (PDC_USART0  ) Base Address */
#define SPI0         ((Spi        *)0x40000400U) /**< \brief (SPI0        ) Base Address */
#define PDC_SPI0     ((Pdc        *)0x40000500U) /**< \brief (PDC_SPI0    ) Base Address */
#define TWI0         ((Twi        *)0x40000600U) /**< \brief (TWI0        ) Base Address */
#define PDC_TWI0     ((Pdc        *)0x40000700U) /**< \brief (PDC_TWI0    ) Base Address */
#define FLEXCOM1     ((Flexcom    *)0x40004000U) /**< \brief (FLEXCOM1    ) Base Address */
#define PDC_FLEXCOM1 ((Pdc        *)0x40004100U) /**< \brief (PDC_FLEXCOM1) Base Address */
#define USART1       ((Usart      *)0x40004200U) /**< \brief (USART1      ) Base Address */
#define PDC_USART1   ((Pdc        *)0x40004300U) /**< \brief (PDC_USART1  ) Base Address */
#define SPI1         ((Spi        *)0x40004400U) /**< \brief (SPI1        ) Base Address */
#define PDC_SPI1     ((Pdc        *)0x40004500U) /**< \brief (PDC_SPI1    ) Base Address */
#define TWI1         ((Twi        *)0x40004600U) /**< \brief (TWI1        ) Base Address */
#define PDC_TWI1     ((Pdc        *)0x40004700U) /**< \brief (PDC_TWI1    ) Base Address */
#define FLEXCOM2     ((Flexcom    *)0x40008000U) /**< \brief (FLEXCOM2    ) Base Address */
#define PDC_FLEXCOM2 ((Pdc        *)0x40008100U) /**< \brief (PDC_FLEXCOM2) Base Address */
#define USART2       ((Usart      *)0x40008200U) /**< \brief (USART2      ) Base Address */
#define PDC_USART2   ((Pdc        *)0x40008300U) /**< \brief (PDC_USART2  ) Base Address */
#define SPI2         ((Spi        *)0x40008400U) /**< \brief (SPI2        ) Base Address */
#define PDC_SPI2     ((Pdc        *)0x40008500U) /**< \brief (PDC_SPI2    ) Base Address */
#define TWI2         ((Twi        *)0x40008600U) /**< \brief (TW20        ) Base Address */
#define PDC_TWI2     ((Pdc        *)0x40008700U) /**< \brief (PDC_TWI2    ) Base Address */
#define FLEXCOM3     ((Flexcom    *)0x4000C000U) /**< \brief (FLEXCOM3    ) Base Address */
#define PDC_FLEXCOM3 ((Pdc        *)0x4000C100U) /**< \brief (PDC_FLEXCOM3) Base Address */
#define USART3       ((Usart      *)0x4000C200U) /**< \brief (USART3      ) Base Address */
#define PDC_USART3   ((Pdc        *)0x4000C300U) /**< \brief (PDC_USART3  ) Base Address */
#define SPI3         ((Spi        *)0x4000C400U) /**< \brief (SPI3        ) Base Address */
#define PDC_SPI3     ((Pdc        *)0x4000C500U) /**< \brief (PDC_SPI3    ) Base Address */
#define TWI3         ((Twi        *)0x4000C600U) /**< \brief (TWI3        ) Base Address */
#define PDC_TWI3     ((Pdc        *)0x4000C700U) /**< \brief (PDC_TWI3    ) Base Address */
#define FLEXCOM4     ((Flexcom    *)0x40010000U) /**< \brief (FLEXCOM4    ) Base Address */
#define PDC_FLEXCOM4 ((Pdc        *)0x40010100U) /**< \brief (PDC_FLEXCOM4) Base Address */
#define USART4       ((Usart      *)0x40010200U) /**< \brief (USART4      ) Base Address */
#define PDC_USART4   ((Pdc        *)0x40010300U) /**< \brief (PDC_USART4  ) Base Address */
#define SPI4         ((Spi        *)0x40010400U) /**< \brief (SPI4        ) Base Address */
#define PDC_SPI4     ((Pdc        *)0x40010500U) /**< \brief (PDC_SPI4    ) Base Address */
#define TWI4         ((Twi        *)0x40010600U) /**< \brief (TWI4        ) Base Address */
#define PDC_TWI4     ((Pdc        *)0x40010700U) /**< \brief (PDC_TWI4    ) Base Address */
#define FLEXCOM5     ((Flexcom    *)0x40014000U) /**< \brief (FLEXCOM5    ) Base Address */
#define PDC_FLEXCOM5 ((Pdc        *)0x40014100U) /**< \brief (PDC_FLEXCOM5) Base Address */
#define USART5       ((Usart      *)0x40014200U) /**< \brief (USART5      ) Base Address */
#define PDC_USART5   ((Pdc        *)0x40014300U) /**< \brief (PDC_USART5  ) Base Address */
#define SPI5         ((Spi        *)0x40014400U) /**< \brief (SPI5        ) Base Address */
#define PDC_SPI5     ((Pdc        *)0x40014500U) /**< \brief (PDC_SPI5    ) Base Address */
#define TWI5         ((Twi        *)0x40014600U) /**< \brief (TWI5        ) Base Address */
#define PDC_TWI5     ((Pdc        *)0x40014700U) /**< \brief (PDC_TWI5    ) Base Address */
#define FLEXCOM6     ((Flexcom    *)0x40018000U) /**< \brief (FLEXCOM6    ) Base Address */
#define PDC_FLEXCOM6 ((Pdc        *)0x40018100U) /**< \brief (PDC_FLEXCOM6) Base Address */
#define USART6       ((Usart      *)0x40018200U) /**< \brief (USART6      ) Base Address */
#define PDC_USART6   ((Pdc        *)0x40018300U) /**< \brief (PDC_USART6  ) Base Address */
#define SPI6         ((Spi        *)0x40018400U) /**< \brief (SPI6        ) Base Address */
#define PDC_SPI6     ((Pdc        *)0x40018500U) /**< \brief (PDC_SPI6    ) Base Address */
#define TWI6         ((Twi        *)0x40018600U) /**< \brief (TWI6        ) Base Address */
#define PDC_TWI6     ((Pdc        *)0x40018700U) /**< \brief (PDC_TWI6    ) Base Address */
#define FLEXCOM7     ((Flexcom    *)0x4001C000U) /**< \brief (FLEXCOM7    ) Base Address */
#define PDC_FLEXCOM7 ((Pdc        *)0x4001C100U) /**< \brief (PDC_FLEXCOM7) Base Address */
#define USART7       ((Usart      *)0x4001C200U) /**< \brief (USART7      ) Base Address */
#define PDC_USART7   ((Pdc        *)0x4001C300U) /**< \brief (PDC_USART7  ) Base Address */
#define SPI7         ((Spi        *)0x4001C400U) /**< \brief (SPI7        ) Base Address */
#define PDC_SPI7     ((Pdc        *)0x4001C500U) /**< \brief (PDC_SPI7    ) Base Address */
#define TWI7         ((Twi        *)0x4001C600U) /**< \brief (TWI7        ) Base Address */
#define PDC_TWI7     ((Pdc        *)0x4001C700U) /**< \brief (PDC_TWI7    ) Base Address */
#define QSPI         ((Qspi       *)0x40020000U) /**< \brief (QSPI        ) Base Address */
#define PDC_QSPI     ((Pdc        *)0x40020100U) /**< \brief (PDC_QSPI    ) Base Address */
#define ADC          ((Adc        *)0x40024000U) /**< \brief (ADC         ) Base Address */
#define PDC_ADC      ((Pdc        *)0x40024100U) /**< \brief (PDC_ADC     ) Base Address */
#define ACC          ((Acc        *)0x40028000U) /**< \brief (ACC         ) Base Address */
#define IPC0         ((Ipc        *)0x4002C000U) /**< \brief (IPC0        ) Base Address */
#define SLCDC        ((Slcdc      *)0x40030000U) /**< \brief (SLCDC       ) Base Address */
#define MEM2MEM0     ((Mem2mem    *)0x40034000U) /**< \brief (MEM2MEM0    ) Base Address */
#define PDC_MEM2MEM0 ((Pdc        *)0x40034100U) /**< \brief (PDC_MEM2MEM0) Base Address */
#define TC0          ((Tc         *)0x40038000U) /**< \brief (TC0         ) Base Address */
#define PDC_TC0      ((Pdc        *)0x40038100U) /**< \brief (PDC_TC0     ) Base Address */
#define TC1          ((Tc         *)0x4003C000U) /**< \brief (TC1         ) Base Address */
#define PDC_TC1      ((Pdc        *)0x4003C100U) /**< \brief (PDC_TC1     ) Base Address */
#define TC2          ((Tc         *)0x40040000U) /**< \brief (TC2         ) Base Address */
#define PDC_TC2      ((Pdc        *)0x40040100U) /**< \brief (PDC_TC2     ) Base Address */
#define MATRIX1      ((Matrix     *)0x40044000U) /**< \brief (MATRIX1     ) Base Address */
#define PIOA         ((PioGroup   *)0x40048000U) /**< \brief (PIOA        ) Base Address */
#define PIOB         ((PioGroup   *)0x40048040U) /**< \brief (PIOB        ) Base Address */
#define PIOC         ((PioGroup   *)0x40048080U) /**< \brief (PIOC        ) Base Address */
#define CHIPID       ((Chipid     *)0x40050200U) /**< \brief (CHIPID      ) Base Address */
#define SFR          ((Sfr        *)0x40050400U) /**< \brief (SFR         ) Base Address */
#define SFRBU        ((Sfrbu      *)0x40050600U) /**< \brief (SFRBU       ) Base Address */
#define DWDT         ((Dwdt       *)0x40052000U) /**< \brief (DWDT        ) Base Address */
#define RSTC         ((Rstc       *)0x40053000U) /**< \brief (RSTC        ) Base Address */
#define RTT          ((Rtt        *)0x40053020U) /**< \brief (RTT         ) Base Address */
#define GPBR         ((Gpbr       *)0x40053060U) /**< \brief (GPBR        ) Base Address */
#define RTC          ((Rtc        *)0x40053100U) /**< \brief (RTC         ) Base Address */
#define SYSCWP       ((Syscwp     *)0x400531A0U) /**< \brief (SYSCWP      ) Base Address */
#define SUPC         ((Supc       *)0x400531D0U) /**< \brief (SUPC        ) Base Address */
#define AES          ((Aes        *)0x44000000U) /**< \brief (AES         ) Base Address */
#define PDC_AES      ((Pdc        *)0x44000100U) /**< \brief (PDC_AES     ) Base Address */
#define AESB         ((Aesb       *)0x44004000U) /**< \brief (AESB        ) Base Address */
#define SHA          ((Sha        *)0x44008000U) /**< \brief (SHA         ) Base Address */
#define PDC_SHA      ((Pdc        *)0x44008100U) /**< \brief (PDC_SHA     ) Base Address */
#define TRNG         ((Trng       *)0x4400C000U) /**< \brief (TRNG        ) Base Address */
#define ICM          ((Icm        *)0x44010000U) /**< \brief (ICM         ) Base Address */
#define CPKCC        ((Cpkcc      *)0x46000000U) /**< \brief (CPKCC       ) Base Address */
#define MATRIX0      ((Matrix     *)0x46004000U) /**< \brief (MATRIX0     ) Base Address */
#define CMCC0        ((Cmcc       *)0x46008000U) /**< \brief (CMCC0       ) Base Address */
#define CMCC1        ((Cmcc       *)0x4600C000U) /**< \brief (CMCC1       ) Base Address */
#define SEFC0        ((Sefc       *)0x460E0000U) /**< \brief (SEFC0       ) Base Address */
#define SEFC1        ((Sefc       *)0x460E0200U) /**< \brief (SEFC1       ) Base Address */
#define PMC          ((Pmc        *)0x46800000U) /**< \brief (PMC         ) Base Address */
#define EMAFE        ((Emafelpfif *)0x48000000U) /**< \brief (EMAFE       ) Base Address */
#define MEM2MEM1     ((Mem2mem    *)0x48004000U) /**< \brief (MEM2MEM1    ) Base Address */
#define PDC_MEM2MEM1 ((Pdc        *)0x48004100U) /**< \brief (PDC_MEM2MEM1) Base Address */
#define TC3          ((Tc         *)0x48008000U) /**< \brief (TC3         ) Base Address */
#define PDC_TC3      ((Pdc        *)0x48008100U) /**< \brief (PDC_TC3     ) Base Address */
#define PIOD         ((PioGroup   *)0x4800C000U) /**< \brief (PIOD        ) Base Address */
#define UART         ((Uart       *)0x48010000U) /**< \brief (UART        ) Base Address */
#define PDC_UART     ((Pdc        *)0x48010100U) /**< \brief (PDC_UART    ) Base Address */
#define IPC1         ((Ipc        *)0x48014000U) /**< \brief (IPC1        ) Base Address */
#define MCSPI        ((Mcspi      *)0x48018000U) /**< \brief (MCSPI       ) Base Address */
#define PDC_MCSPI    ((Pdc        *)0x48018100U) /**< \brief (PDC_MCSPI   ) Base Address */
#define PWM          ((Pwm        *)0x4801C000U) /**< \brief (PWM         ) Base Address */
#define PDC_PWM      ((Pdc        *)0x4801C100U) /**< \brief (PDC_PWM     ) Base Address */
#define MATRIX3      ((Matrix     *)0x48020000U) /**< \brief (MATRIX3     ) Base Address */
#define MATRIX2      ((Matrix     *)0x4A000000U) /**< \brief (MATRIX2     ) Base Address */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/*@}*/

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX5112MTSH100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX5112MTSH100_pio Peripheral Pio Definitions */
/*@{*/

